<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Zeplin and imports into a JAMF Pro Server.</string>
        <key>Identifier</key>
	<string>com.github.kylejericson.jss-upload.Zeplin</string>
        <key>Input</key>
        <dict>
            <key>CATEGORY</key>
            <string>Applications</string>
            <key>NAME</key>
            <string>Zeplin</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
        <string>com.github.hobbithardcase.pkg.Zeplin</string>
        <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>