<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Proximity and imports it into your JSS.</string>
	<key>Identifier</key>
    <string>com.github.kylejericson.autopkg-recipes.jss.Proximity-upload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>NAME</key>
		<string>Cisco Proximity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.Proximity</key>
			<dict>
				<key>git_hash</key>
				<string>fa5cfb4b2d36ca28e9a5af8d3ac523ff82689618</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Cisco/Proximity.download.recipe</string>
				<key>sha256_hash</key>
				<string>c30dad09234490b5ea74b031235f7c5f119d4e984314c54402dc2957114a593d</string>
			</dict>
			<key>com.github.homebysix.pkg.Proximity</key>
			<dict>
				<key>git_hash</key>
				<string>54ebd6b1059db1d1512c1880a6dcb366ce2ce7dd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Cisco/Proximity.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5ec605ad176a8492f6f1448e59c1ec87bd72893c0b70cb6e15321249dbac7678</string>
			</dict>
			<key>com.github.kylejericson.autopkg-recipes.jss.Proximity-upload</key>
			<dict>
				<key>git_hash</key>
				<string>9908bc33ef0a23be7a0dd6dddd0a5470b5724c7f</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.kylejericson.autopkg-recipes/Cisco Proximity/Proximity-upload.jss.recipe</string>
				<key>sha256_hash</key>
				<string>2a43c58c6e900f1a502009e8e2ce8e768c68c9b2e63fc8b87e4703b6cc4e42e7</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>