<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Proximity-upload</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.cisco.experimental.Proximity</string>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>DOWNLOAD_URL</key>
		<string>https://proximity.cisco.com/mac/Proximity.dmg</string>
		<key>NAME</key>
		<string>Cisco Proximity</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.kylejericson.autopkg-recipes.Proximity-upload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.homebysix.VersionSplitter/VersionSplitter</key>
			<dict>
				<key>git_hash</key>
				<string>acf638a7818a097b9aae780fed065e582d38bb94</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/VersionSplitter/VersionSplitter.py</string>
				<key>sha256_hash</key>
				<string>51baa46b916fa00b4dab826e9065a94fd27a75174a279225f89a4c18a700ae6e</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.Proximity</key>
			<dict>
				<key>git_hash</key>
				<string>fa5cfb4b2d36ca28e9a5af8d3ac523ff82689618</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Cisco/Proximity.download.recipe</string>
				<key>sha256_hash</key>
				<string>c30dad09234490b5ea74b031235f7c5f119d4e984314c54402dc2957114a593d</string>
			</dict>
			<key>com.github.homebysix.pkg.Proximity</key>
			<dict>
				<key>git_hash</key>
				<string>54ebd6b1059db1d1512c1880a6dcb366ce2ce7dd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Cisco/Proximity.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5ec605ad176a8492f6f1448e59c1ec87bd72893c0b70cb6e15321249dbac7678</string>
			</dict>
			<key>com.github.kylejericson.autopkg-recipes.Proximity-upload</key>
			<dict>
				<key>git_hash</key>
				<string>500d8b5543bbfd23c5e06693c7a90fa6a36caf9d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.kylejericson.autopkg-recipes/Cisco Proximity/Proximity-upload.jss.recipe</string>
				<key>sha256_hash</key>
				<string>6bbd5c160b1a72de82250d6259483b6848bbd76ca0dc674012b53f05ad3d334c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
